[
 {
  "Title": "BIOC 212 Molecular Mechanisms of Cell Function (3 credits)",
  "Code": "BIOC 212",
  "Credits": 3,
  "Overview": "Biochemistry : An introductory course describing the biochemistry and molecular biology of selected key functions of animal cells, including: gene expression; mitochondrial production of metabolic energy; cellular communication with the extra-cellular environment; and regulation of cell division.",
  "Meta": "Offered by: Biochemistry (Faculty of Science)",
  "Terms": [
   "Winter 2025"
  ],
  "Instructors": "Vera Ugalde, Maria; Pause, Arnim; Reinhardt, Dieter; Kazak, Lawrence; Cockburn, Katie (Winter)",
  "Notes": [
   "Winter",
   "Prerequisite: BIOL 200",
   "Restrictions: A non-terminal course intended to be followed by BIOC 311; BIOC 312 in the U2 year. Not open to students who have taken or are taking BIOL 201 or ANAT 212."
  ]
 },
 {
  "Title": "BIOC 220 Laboratory Methods in Biochemistry and Molecular Biology 1 (3 credits)",
  "Code": "BIOC 220",
  "Credits": 3,
  "Overview": "Biochemistry : Introduction to key methodologies for the isolation, detection and characterization of proteins, lipids, nucleic acids and subcellular fractions, including spectrophotometry, assays of enzymatic activities and chromatographic and electrophoretic methods. Analysis of biochemical data.",
  "Meta": "Offered by: Biochemistry (Faculty of Science)",
  "Terms": [
   "Winter 2025"
  ],
  "Instructors": "Chang, Natasha (Winter)",
  "Notes": [
   "Prerequisite(s): BIOL 200",
   "Corequisite(s): BIOC 212 and CHEM222",
   "Restriction(s): Not open to students who have taken or are taking BIOL 301. Open to students in Biochemistry programs, others with permission of the instructor."
  ]
 },
 {
  "Title": "BIOL 200 Molecular Biology (3 credits)",
  "Code": "BIOL 200",
  "Credits": 3,
  "Overview": "Biology (Sci) : The physical and chemical properties of the cell and its components in relation to their structure and function. Topics include: protein structure, enzymes and enzyme kinetics; nucleic acid replication, transcription and translation; the genetic code, mutation, recombination, and regulation of gene expression.",
  "Meta": "Offered by: Biology (Faculty of Science)",
  "Terms": [
   "Fall 2024"
  ],
  "Instructors": "Champetier, Serge; Hastings, Kenneth E M; Lasko, Paul; Turney, Shaun; Reyes Lamothe, Rodrigo (Fall)",
  "Notes": [
   "Fall",
   "3 hours lecture, 1 hour optional tutorial",
   "Prerequisite: BIOL 112 or equivalent",
   "Corequisite: CHEM 212 or equivalent, or CHEM 204"
  ]
 },
 {
  "Title": "BIOL 202 Basic Genetics (3 credits)",
  "Code": "BIOL 202",
  "Credits": 3,
  "Overview": "Biology (Sci) : Introduction to basic principles, and to modern advances, problems and applications in the genetics of higher and lower organisms with examples representative of the biological sciences.",
  "Meta": "Offered by: Biology (Faculty of Science)",
  "Terms": [
   "Winter 2025"
  ],
  "Instructors": "Moon, Nam Sung; Nilson, Laura; Schoen, Daniel J; Hipfner, David; Champetier, Serge (Winter)",
  "Notes": [
   "Winter",
   "3 hours lecture, 1 hour optional tutorial per week",
   "Prerequisite: BIOL 200 or BIOL 219",
   "Restriction: Not open to students who have taken or are taking LSCI 204 or BIOL 302."
  ]
 },
 {
  "Title": "CHEM 204 Physical Chemistry/Biological\n Sciences 1 (3 credits)",
  "Code": "CHEM 204",
  "Credits": 3,
  "Overview": "Chemistry : Similar to CHEM 223/CHEM 243. Emphasis on the use of biological examples to illustrate the principles of physical chemistry. The relevance of physical chemistry to biology is stressed.",
  "Meta": "Offered by: Chemistry (Faculty of Science)",
  "Terms": [
   "Fall 2024",
   "Winter 2025"
  ],
  "Instructors": "Khaliullin, Rustam (Fall) Caire da Silva, Lucas (Winter)",
  "Notes": [
   "Fall, Winter",
   "Prerequisites: CHEM 110 and CHEM 120 or equivalent and one full course in calculus",
   "Restriction: Not open to students who have taken or are taking CHEM 203 or CHEM 213."
  ]
 },
 {
  "Title": "CHEM 212 Introductory Organic Chemistry 1 (4 credits)",
  "Code": "CHEM 212",
  "Credits": 4,
  "Overview": "Chemistry : A fundamental study of aliphaticcompounds and saturated functional groups including modern concepts of bonding,reaction mechanisms,conformational analysis, spectroscopy, and stereochemistry.",
  "Meta": "Offered by: Chemistry (Faculty of Science)",
  "Terms": [
   "Fall 2024"
  ],
  "Instructors": "Vlaho, Danielle; Huot, Mitchell; Sirjoosingh, Pallavi; Tsantrizos, Youla S; Pavelka, Laura; Luedtke, Nathan (Fall)",
  "Notes": [
   "Fall, Summer",
   "Prerequisite: CHEM 110 and CHEM 120 or equivalent.",
   "Restriction: Not open to students registered in Chemistry or Biochemistry. Not open to students who have taken or are taking CHEM 211, CHEM 242, or equivalent.",
   "Each lab section is limited enrolment",
   "Note: Some CEGEP programs provide equivalency for this course. For more information, please see the Department of Chemistry's Web page (http://www.chemistry.mcgill.ca/advising/outside/equivalent.htm).",
   "**Due to the intensive nature of this course, the standard add/drop and withdrawal deadlines do not apply. Add/drop is the second lecture day and withdrawal is the fourth lecture day."
  ]
 },
 {
  "Title": "CHEM 222 Introductory Organic Chemistry 2 (4 credits)",
  "Code": "CHEM 222",
  "Credits": 4,
  "Overview": "Chemistry : Modern spectroscopic techniques for structure determination. The chemistry of alcohols, ethers, carbonyl compounds, and amines, with special attention to mechanistic aspects. Special topics.",
  "Meta": "Offered by: Chemistry (Faculty of Science)",
  "Terms": [
   "Winter 2025"
  ],
  "Instructors": "Vlaho, Danielle; Huot, Mitchell; Sirjoosingh, Pallavi; Moitessier, Nicolas; Luedtke, Nathan (Winter)",
  "Notes": [
   "Winter, Summer",
   "Prerequisite: CHEM 212 or CHEM 242 or equivalent.",
   "Restriction: Not open to Chemistry or Biochemistry students. Not open to students who have taken or are taking CHEM 234 or CHEM252."
  ]
 },
 {
  "Title": "BIOL 205 Functional Biology of Plants and Animals (3 credits)",
  "Code": "BIOL 205",
  "Credits": 3,
  "Overview": "Biology (Sci) : Unified view of form and function in animals and plants. Focus on how the laws of chemistry and physics illuminate biological processes relating to the acquisition of energy and materials and their use in movement, growth, development, reproduction and responses to environmental stress.",
  "Meta": "Offered by: Biology (Faculty of Science)",
  "Terms": [
   "Winter 2025"
  ],
  "Instructors": "Sakata, Jon; Barrett, Rowan; Soper, Fiona (Winter)",
  "Notes": [
   "Winter",
   "3 hours lecture, optional conference hour",
   "Prerequisites: BIOL 200 and PHYS 101 or 131 or equivalent",
   "Corequisite: ANAT 212/BIOC 212 or BIOL 201"
  ]
 },
 {
  "Title": "MIMM 211 Introductory Microbiology (3 credits)",
  "Code": "MIMM 211",
  "Credits": 3,
  "Overview": "Microbiology and Immun (Sci) : A general treatment of microbiology bearing specifically on the biological properties of microorganisms. Emphasis will be on procaryotic cells. Basic principles of microbial genetics are also introduced.",
  "Meta": "Offered by: Microbiology \u0026 Immunology (Faculty of Science)",
  "Terms": [
   "Fall 2024"
  ],
  "Instructors": "Cousineau, Benoit; Nguyen, Dao; Matlashewski, Greg J; Gruenheid, Samantha; Chahal, Jasmin; Maurice, Corinne; Le Mauff, Francois (Fall)",
  "Notes": [
   "Fall",
   "3 hours of lecture",
   "Corequisite: BIOL 200"
  ]
 },
 {
  "Title": "MIMM 214 Introductory Immunology: Elements of Immunity (3 credits)",
  "Code": "MIMM 214",
  "Credits": 3,
  "Overview": "Microbiology and Immun (Sci) : Basic immunology, organs and cells, elements of innate immunity, phagocytes, complement, elements of adaptive immunity, B-cells, T-cells, antigen presenting cells, MHC genes and molecules, antigen processing and presentation, cytokines and chemokines. Emphasis on anatomy and the molecular and cellular players working together as a physiological system to maintain human health.",
  "Meta": "Offered by: Microbiology \u0026 Immunology (Faculty of Science)",
  "Terms": [
   "Winter 2025"
  ],
  "Instructors": "Chahal, Jasmin (Winter)",
  "Notes": [
   "Prerequisite: BIOL 200",
   "Corequisite: BIOL 201 or ANAT 212/BIOC 212"
  ]
 },
 {
  "Title": "PHGY 209 Mammalian Physiology 1 (3 credits)",
  "Code": "PHGY 209",
  "Credits": 3,
  "Overview": "Physiology : Physiology of body fluids, blood, body defense mechanisms, muscle, peripheral, central, and autonomic nervous systems.",
  "Meta": "Offered by: Physiology (Faculty of Science)",
  "Terms": [
   "Fall 2024"
  ],
  "Instructors": "Vollrath, Melissa; Ragsdale, David S; Shrier, Alvin; Cook, Erik; Aguer, Céline (Fall)",
  "Notes": [
   "Fall",
   "3 hours lectures weekly",
   "Prerequisites: BIOL 112, CHEM 110, CHEM 120, PHYS 101 or PHYS 131, and PHYS 102 or PHYS 142. Pre-/co-requisites: BIOL 200, CHEM 212 or equivalent.",
   "Restriction: Not open to students who have taken PHGY 211 or students who are taking and who have taken NSCI 200.",
   "Restriction: For students in the Faculty of Science, and other students by permission of the instructor"
  ]
 },
 {
  "Title": "PHGY 210 Mammalian Physiology 2 (3 credits)",
  "Code": "PHGY 210",
  "Credits": 3,
  "Overview": "Physiology : Physiology of cardiovascular, respiratory, digestive, endocrine and renal systems.",
  "Meta": "Offered by: Physiology (Faculty of Science)",
  "Terms": [
   "Winter 2025"
  ],
  "Instructors": "Vollrath, Melissa; Takano, Tomoko; Lauzon, Anne-Marie; White, John H; Aguer, Céline (Winter)",
  "Notes": [
   "Winter",
   "3 hours lectures weekly",
   "Prerequisites: BIOL 112, CHEM 110, CHEM 120, PHYS 101 or PHYS 131, and PHYS 102 or PHYS 142. Pre-/co-requisite: BIOL 200, BIOL 201, BIOC 212, CHEM 212 or equivalent.",
   "Restriction: For students in the Faculty of Science, and other students by permission of the instructor",
   "Although PHGY 210 may be taken without the prior passing of PHGY 209, students should note that they may have some initial difficulties because of lack of familiarity with some basic concepts introduced in PHGY 209"
  ]
 },
 {
  "Title": "ANAT 262 Introductory Molecular and Cell Biology (3 credits)",
  "Code": "ANAT 262",
  "Credits": 3,
  "Overview": "Anatomy \u0026 Cell Biology : The architectural, functional and temporal continuity of organelles and the cytoskeleton of mammalian cells is introduced as well as their functional integration in the phenomena of exocytosis, endocytosis, protein trafficking and cell motility and adhesion.",
  "Meta": "Offered by: Anatomy and Cell Biology (Faculty of Science)",
  "Terms": [
   "Winter 2025"
  ],
  "Instructors": "Presley, John; Stochaj, Ursula; Bechstedt, Susanne; Bui, Khanh Huy (Winter)",
  "Notes": [
   "Winter",
   "3 hours lecture",
   "Corequisites: ANAT 212 or BIOC 212 or BIOL 201",
   "Restriction: Open to students in biological sciences and others by special permission"
  ]
 },
 {
  "Title": "BIOC 311 Metabolic Biochemistry (3 credits)",
  "Code": "BIOC 311",
  "Credits": 3,
  "Overview": "Biochemistry : The generation of metabolic energy in higher organisms with an emphasis on its regulation at the molecular, cellular and organ level. Chemical concepts and mechanisms of enzymatic catalysis are also emphasized. Included: selected topics in carbohydrate, lipid and nitrogen metabolism; complex lipids and biological membranes; hormonal signal transduction.",
  "Meta": "Offered by: Biochemistry (Faculty of Science)",
  "Terms": [
   "Fall 2024"
  ],
  "Instructors": "Denis, Maxime; Giguere, Vincent; Gehring, Kalle; Kazak, Lawrence (Fall)",
  "Notes": [
   "Fall",
   "Prerequisites: BIOL 200, BIOL 201 or BIOC 212, CHEM 222 or CHEM 234"
  ]
 },
 {
  "Title": "BIOC 312 Biochemistry of Macromolecules (3 credits)",
  "Code": "BIOC 312",
  "Credits": 3,
  "Overview": "Biochemistry : Gene expression from the start of transcription to the synthesis of proteins, their modifications and degradation. Topics covered: purine and pyrimidine metabolism; transcription and its regulation; mRNA processing; translation; targeting of proteins to specific cellular sites; protein glycosylation; protein phosphorylation; protein turn-over; programmed cell death (apoptosis).",
  "Meta": "Offered by: Biochemistry (Faculty of Science)",
  "Terms": [
   "Winter 2025"
  ],
  "Instructors": "Huang, Sidong; Richard, Stephane; Sonenberg, Nahum; Tremblay, Michel; Dostie, Josee; Giguere, Vincent; Vera Ugalde, Maria (Winter)",
  "Notes": [
   "Winter",
   "Prerequisites: BIOC 311, BIOL 200, BIOL 201 or BIOC 212"
  ]
 },
 {
  "Title": "BIOC 320 Laboratory Methods in Biochemistry and Molecular Biology 2 (3 credits)",
  "Code": "BIOC 320",
  "Credits": 3,
  "Overview": "Biochemistry : Modern molecular-biological methods for isolation and characterization of nucleic acids and for analysis of RNA and protein expression, including: plasmid expression, isolation, restriction and ligation; electrophoretic methods and Western blotting; PCR and qPCR applications; immunofluorescence microscopy and basic bioinformatics approaches.",
  "Meta": "Offered by: Biochemistry (Faculty of Science)",
  "Terms": [
   "Fall 2024"
  ],
  "Instructors": "Teodoro, Jose Guerreiro (Fall)",
  "Notes": [
   "Prerequisite(s): BIOC 220",
   "Restriction(s): Not open to students who have taken or are taking BIOL 301. Open to students in Biochemistry programs; others with permission of the instructor."
  ]
 },
 {
  "Title": "CHEM 214 Physical Chemistry/Biological Sciences 2 (3 credits)",
  "Code": "CHEM 214",
  "Credits": 3,
  "Overview": "Chemistry : Emphasis is placed on the use of biological examples to illustrate the principles of physical chemistry. The relevance of physical chemistry to biology is stressed.",
  "Meta": "Offered by: Chemistry (Faculty of Science)",
  "Terms": [
   "Winter 2025"
  ],
  "Instructors": "Kambhampati, Patanjali (Winter)",
  "Notes": [
   "Winter",
   "Prerequisites: CHEM 204 or CHEM 223/CHEM 243."
  ]
 },
 {
  "Title": "CHEM 302 Introductory Organic Chemistry 3 (3 credits)",
  "Code": "CHEM 302",
  "Credits": 3,
  "Overview": "Chemistry : Topics covered may include the following: Aromatic compounds, heterocyclic chemistry, sulfur and phosphorus chemistry, organosulfur and organophosphorus compounds, and biomolecules such as lipids, carbohydrates, amino acids, polypeptides, DNA and RNA.",
  "Meta": "Offered by: Chemistry (Faculty of Science)",
  "Terms": [
   "Fall 2024"
  ],
  "Instructors": "Damha, Masad J (Fall)",
  "Notes": [
   "Fall",
   "Prerequisites: CHEM 222, or permission of the instructor."
  ]
 },
 {
  "Title": "CHEM 362 Advanced Organic Chemistry Laboratory (2 credits)",
  "Code": "CHEM 362",
  "Credits": 2,
  "Overview": "Chemistry : An advanced laboratory with experiments related to the theoretical principles and synthetic methods of modern organic chemistry.",
  "Meta": "Offered by: Chemistry (Faculty of Science)",
  "Terms": [
   "Fall 2024",
   "Winter 2025"
  ],
  "Instructors": "Huot, Mitchell; Vlaho, Danielle (Fall) Huot, Mitchell; Vlaho, Danielle (Winter)",
  "Notes": [
   "Fall, Winter",
   "Prerequisite or corequisite: CHEM 302. Not open to Honours or Majors in Chemistry"
  ]
 },
 {
  "Title": "BIOL 309 Mathematical Models in Biology (3 credits)",
  "Code": "BIOL 309",
  "Credits": 3,
  "Overview": "Biology (Sci) : Application of finite difference and differential equations to problems in cell and developmental biology, ecology and physiology. Qualitative, quantitative and graphical techniques are used to analyze mathematical models and to compare theoretical predictions with experimental data.",
  "Meta": "Offered by: Biology (Faculty of Science)",
  "Terms": [
   "Fall 2024"
  ],
  "Instructors": "Bub, Gil; Guichard, Frederic (Fall)",
  "Notes": [
   "Fall",
   "3 hours lecture",
   "Prerequisites:BIOL 200, BIOL 201 (or ANAT 212/BIOC 212); or BIOL 219"
  ]
 },
 {
  "Title": "BIOL 373 Biometry (3 credits)",
  "Code": "BIOL 373",
  "Credits": 3,
  "Overview": "Biology (Sci) : Elementary statistical methods in biology. Introduction to the analysis of biological data with emphasis on the assumptions behind statistical tests and models. Use of statistical techniques typically available on computer packages.",
  "Meta": "Offered by: Biology (Faculty of Science)",
  "Terms": [
   "This course is not scheduled for the 2024-2025 academic year."
  ],
  "Instructors": "There are no professors associated with this course for the 2024-2025 academic year.",
  "Notes": [
   "Fall",
   "2 hours lecture and 2 hours laboratory",
   "Prerequisite: MATH 112 or equivalent",
   "You may not be able to receive credit for this course and other statistic courses. Be sure to check the Course Overlap section under Faculty Degree Requirements in the Arts or Science section of the Calendar."
  ]
 },
 {
  "Title": "CHEM 267 Introductory Chemical Analysis (3 credits)",
  "Code": "CHEM 267",
  "Credits": 3,
  "Overview": "Chemistry : Qualitative and quantitative analysis. A survey of methods of analysis including theory and practice of semimicro qualitative analysis and representative gravimetric, volumetric and instrumental methods. The laboratory component includes introductory experiments in analytical chemistry emphasizing classical and instrumental methods of quantitative analysis.",
  "Meta": "Offered by: Chemistry (Faculty of Science)",
  "Terms": [
   "Fall 2024"
  ],
  "Instructors": "Mauzeroll, Janine; Sewall, Samuel Lewis; Sirjoosingh, Pallavi; Gauthier, Jean-Marc (Fall)",
  "Notes": [
   "Prerequisite(s): CHEM 110 and CHEM 120, or equivalent",
   "Restriction(s): Not open to students who have taken CHEM 287 or CHEM 297"
  ]
 },
 {
  "Title": "COMP 202 Foundations of Programming (3 credits)",
  "Code": "COMP 202",
  "Credits": 3,
  "Overview": "Computer Science (Sci) : Introduction to computer programming in a high level language: variables, expressions, primitive types, methods, conditionals, loops. Introduction to algorithms, data structures (arrays, strings), modular software design, libraries, file input/output, debugging, exception handling. Selected topics.",
  "Meta": "Offered by: Computer Science (Faculty of Science)",
  "Terms": [
   "Fall 2024",
   "Winter 2025"
  ],
  "Instructors": "M'hiri, Faten (Fall) M'hiri, Faten (Winter)",
  "Notes": [
   "3 hours",
   "Restrictions: Not open to students who have taken or are taking COMP 204, COMP 208, or GEOG 333; not open to students who have taken or are taking COMP 206 or COMP 250.",
   "COMP 202 is intended as a general introductory course, while COMP 204 is intended for students in life sciences, and COMP 208 is intended for students in physical sciences and engineering.",
   "To take COMP 202, students should have a solid understanding of pre-calculus fundamentals such as polynomial, trigonometric, exponential, and logarithmic functions."
  ]
 },
 {
  "Title": "COMP 204 Computer Programming for Life Sciences (3 credits)",
  "Code": "COMP 204",
  "Credits": 3,
  "Overview": "Computer Science (Sci) : Computer Science (Sci): Computer programming in a high level language: variables, expressions, types, functions, conditionals, loops, objects and classes. Introduction to algorithms, modular software design, libraries, file input/output, debugging. Emphasis on applications in the life sciences.",
  "Meta": "Offered by: Computer Science (Faculty of Science)",
  "Terms": [
   "Fall 2024",
   "Winter 2025"
  ],
  "Instructors": "Becerra, David (Fall) Siddiqi, Kaleem (Winter)",
  "Notes": [
   "Prerequisite(s): CEGEP level mathematics course.",
   "Co-requisite: BIOL 112",
   "Restrictions: Not open to students who have taken or are taking COMP 202, COMP 208, or GEOG 333; not open to students who have taken or are taking COMP 206 or COMP 250."
  ]
 },
 {
  "Title": "MATH 203 Principles of Statistics 1 (3 credits)",
  "Code": "MATH 203",
  "Credits": 3,
  "Overview": "Mathematics \u0026 Statistics (Sci) : Examples of statistical data and the use of graphical means to summarize the data. Basic distributions arising in the natural and behavioural sciences. The logical meaning of a test of significance and a confidence interval. Tests of significance and confidence intervals in the one and two sample setting (means, variances and proportions).",
  "Meta": "Offered by: Mathematics and Statistics (Faculty of Science)",
  "Terms": [
   "Fall 2024",
   "Winter 2025"
  ],
  "Instructors": "Stephens, David; Correa, Jose Andres (Fall) Sajjad, Alia (Winter)",
  "Notes": [
   "No calculus prerequisites",
   "Restriction: This course is intended for students in all disciplines. For extensive course restrictions covering statistics courses see Section 3.6.1 of the Arts and of the Science sections of the calendar regarding course overlaps.",
   "You may not be able to receive credit for this course and other statistic courses. Be sure to check the Course Overlap section under Faculty Degree Requirements in the Arts or Science section of the Calendar. Students should consult http://www.mcgill.ca/students/transfercredit for information regarding transfer credits for this course."
  ]
 },
 {
  "Title": "MATH 222 Calculus 3 (3 credits)",
  "Code": "MATH 222",
  "Credits": 3,
  "Overview": "Mathematics \u0026 Statistics (Sci) : Taylor series, Taylor's theorem in one and several variables. Review of vector geometry. Partial differentiation, directional derivative. Extreme of functions of 2 or 3 variables. Parametric curves and arc length. Polar and spherical coordinates. Multiple integrals.",
  "Meta": "Offered by: Mathematics and Statistics (Faculty of Science)",
  "Terms": [
   "Fall 2024",
   "Winter 2025"
  ],
  "Instructors": "Pym, Brent; Tageddine, Damien (Fall)",
  "Notes": [
   "Prerequisite: MATH 141. Familiarity with vector geometry or Corequisite: MATH 133",
   "Restriction: Not open to students who have taken MATH 150, MATH 151 or MATH 262."
  ]
 },
 {
  "Title": "PSYC 204 Introduction to Psychological Statistics (3 credits)",
  "Code": "PSYC 204",
  "Credits": 3,
  "Overview": "Psychology : The statistical analysis of research data; frequency distributions; graphic representation; measures of central tendency and variability; elementary sampling theory and tests of significance.",
  "Meta": "Offered by: Psychology (Faculty of Science)",
  "Terms": [
   "Fall 2024",
   "Winter 2025"
  ],
  "Instructors": "Kreitewolf, Jens (Fall) Kreitewolf, Jens (Winter)",
  "Notes": [
   "Fall and Winter",
   "Restriction: Not open to students who have passed a CEGEP statistics course(s) with a minimum grade of 75%: Mathematics 201-307 or 201-337 or equivalent or the combination of Quantitative Methods 300 with Mathematics 300",
   "This course is a prerequisite for PSYC 305, PSYC 406, PSYC 310, PSYC 336",
   "You may not be able to receive credit for this course and other statistic courses. Be sure to check the Course Overlap section under Faculty Degree Requirements in the Arts or Science section of the Calendar."
  ]
 },
 {
  "Title": "BIOC 450 Protein Structure and Function (3 credits)",
  "Code": "BIOC 450",
  "Credits": 3,
  "Overview": "Biochemistry : Primary, secondary, tertiary and quaternary structure of enzymes. Active site mapping and site-specific mutagenesis of enzymes. Enzyme kinetics and mechanisms of catalysis. Multienzyme complexes.",
  "Meta": "Offered by: Biochemistry (Faculty of Science)",
  "Terms": [
   "Fall 2024"
  ],
  "Instructors": "Nagar, Bhushan; Schmeing, Thomas Martin; Purisima, Enrico; Gehring, Kalle; von Roretz, Christopher; Thibodeaux, Christopher; Guarne, Alba; Vera Ugalde, Maria; Zeytuni, Natalie (Fall)",
  "Notes": [
   "Fall",
   "Prerequisites: BIOC 311, BIOC 312 and/or sufficient organic chemistry.",
   "Restriction: Intended primarily for students at the U3 level"
  ]
 },
 {
  "Title": "BIOC 454 Nucleic Acids (3 credits)",
  "Code": "BIOC 454",
  "Credits": 3,
  "Overview": "Biochemistry : RNA processing, localization and stability. RNAi mechanisms, regulation and applications. Regulation of DNA replication. Genomics: human genome sequence, regulation and organization. DNA repair mechanisms. Special topics on transgenics, genetic diseases and cancer.",
  "Meta": "Offered by: Biochemistry (Faculty of Science)",
  "Terms": [
   "Fall 2024"
  ],
  "Instructors": "Pastor, William; Teodoro, Jose Guerreiro; Gallouzi, Imed Eddine; Nepveu, Alain; Dostie, Josee; Duchaine, Thomas; Fabian, Marc; Huang, Sidong; Watson, Ian; Cockburn, Katie (Fall)",
  "Notes": [
   "Fall",
   "Prerequisites: BIOC 311, BIOC 312 or permission of instructor"
  ]
 },
 {
  "Title": "BIOC 458 Membranes and Cellular Signaling (3 credits)",
  "Code": "BIOC 458",
  "Credits": 3,
  "Overview": "Biochemistry : An integrated treatment of the properties of biological membranes and of intracellular signaling, including the major role that membranes play in transducing and integrating cellular regulatory signals. Biological membrane organization and dynamics: membrane transport; membrane receptors and their associated effectors; mechanisms of regulation of cell growth, morphology, differentiation and death.",
  "Meta": "Offered by: Biochemistry (Faculty of Science)",
  "Terms": [
   "Winter 2025"
  ],
  "Instructors": "Denis, Maxime; Autexier, Chantal; Lamarche, Nathalie; Reinhardt, Dieter (Winter)",
  "Notes": [
   "Winter",
   "Prerequisites: BIOC 212 or ANAT 212 or BIOL201, ANAT 262, one of PHGY 209 or BIOL 205; one of BIOC 312 or ANAT 365; BIOC 311 recommended",
   "Restriction: This course is also listed as ANAT 458. Not open to students who have taken or are taking ANAT 458."
  ]
 },
 {
  "Title": "BIOC 470 Lipids and Lipoproteins in Disease (3 credits)",
  "Code": "BIOC 470",
  "Credits": 3,
  "Overview": "Biochemistry : Structure, function and metabolism of lipids and lipoproteins as they relate to lipid storage diseases, obesity, insulin resistance, diabetes, heart disease, Alzheimers disease and other neurological diseases. Transcriptional and post-translational mechanisms governing the synthesis and degradation of important enzymes, lipids, and lipid transport molecules; role of lipid mediators in signaling pathways and protein modification; assembly and dynamics of lipoproteins and biological membranes; genetic disruptions of lipid regulatory proteins such as cell surface receptors leading to human disease.",
  "Meta": "Offered by: Biochemistry (Faculty of Science)",
  "Terms": [
   "Winter 2025"
  ],
  "Instructors": "Kiss, Robert; Nilsson, Tommy (Winter)",
  "Notes": [
   "Prerequisite(s): BIOC 311 or equivalent."
  ]
 },
 {
  "Title": "BIOC 491 Independent Research (6 credits)",
  "Code": "BIOC 491",
  "Credits": 6,
  "Overview": "Biochemistry : Individual work on a project to be performed in a research laboratory.",
  "Meta": "Offered by: Biochemistry (Faculty of Science)",
  "Terms": [
   "Fall 2024",
   "Winter 2025"
  ],
  "Instructors": "Pause, Arnim (Winter)",
  "Notes": [
   "Winter",
   "Prerequisite: BIOC 462",
   "Restriction: Registration by departmental permission only"
  ]
 },
 {
  "Title": "BIOC 503 Biochemistry of Immune Diseases (3 credits)",
  "Code": "BIOC 503",
  "Credits": 3,
  "Overview": "Biochemistry : Current selected topics in immunology. The biochemical mechanisms underlying various immuno-pathologies and the clinical significance of therapeutic interventions.",
  "Meta": "Offered by: Biochemistry (Faculty of Science)",
  "Terms": [
   "Winter 2025"
  ],
  "Instructors": "Tsoukas, Christos M; Denis, Maxime (Winter)",
  "Notes": [
   "Winter",
   "Prerequisites: BIOC 311, BIOC 312"
  ]
 },
 {
  "Title": "PSYT 455 Neurochemistry (3 credits)",
  "Code": "PSYT 455",
  "Credits": 3,
  "Overview": "Psychiatry : Covers biochemical mechanisms underlying central nervous system function. Introduces basic neuroanatomy, CNS cell types and morphology, neuronal excitability, chemically mediated transmission, glial function. Biochemistry of specific neurotransmitters, endocrine effects on brain, brain energy metabolism and cerebral ischemia (stroke). With examples, where relevant, of biochemical processes disrupted in human CNS disease.",
  "Meta": "Offered by: Psychiatry (Faculty of Science)",
  "Terms": [
   "This course is not scheduled for the 2024-2025 academic year."
  ],
  "Instructors": "There are no professors associated with this course for the 2024-2025 academic year.",
  "Notes": [
   "Winter",
   "Prerequisite(s): BIOC 311, BIOC 312",
   "Restriction: Not open to students who have taken BIOC 455"
  ]
 },
 {
  "Title": "BIOL 300 Molecular Biology of the Gene (3 credits)",
  "Code": "BIOL 300",
  "Credits": 3,
  "Overview": "Biology (Sci) : A survey of current knowledge and approaches in the area of regulation of gene expression, post-transcriptional control of gene expression, and signal transduction.",
  "Meta": "Offered by: Biology (Faculty of Science)",
  "Terms": [
   "Fall 2024"
  ],
  "Instructors": "Schöck, Frieder; Moon, Nam Sung (Fall)",
  "Notes": [
   "Fall",
   "3 hours lecture",
   "Prerequisites: BIOL 219 or BIOL 200 plus either BIOL 201 or ANAT 212/BIOC 212"
  ]
 },
 {
  "Title": "BIOL 303 Developmental Biology (3 credits)",
  "Code": "BIOL 303",
  "Credits": 3,
  "Overview": "Biology (Sci) : A consideration of the fundamental processes and principles operating during embryogenesis. Experimental analyses at the molecular, cellular, and organismal levels will be presented and discussed to provide an overall appreciation of developmental phenomena.",
  "Meta": "Offered by: Biology (Faculty of Science)",
  "Terms": [
   "Winter 2025"
  ],
  "Instructors": "Gerhold, Abigail; Rao, Yong; Dufort, Daniel (Winter)",
  "Notes": [
   "Winter",
   "3 hours lecture and 1 hour optional tutorial",
   "Prerequisites: BIOL 202 or BIOL 302; BIOL 219 or BIOL 200 plus either BIOL 201 or ANAT212/BIOC212",
   "Corequisites: BIOL 202.",
   "Restrictions: Not open to students who have taken ANAT 381."
  ]
 },
 {
  "Title": "BIOL 304 Evolution (3 credits)",
  "Code": "BIOL 304",
  "Credits": 3,
  "Overview": "Biology (Sci) : A comprehensive introduction to evolutionary biology. It covers both short-term and long-term evolutionary processes. Topics include the history of life, the origin of species, adaptation, natural selection and sexual selection.",
  "Meta": "Offered by: Biology (Faculty of Science)",
  "Terms": [
   "Fall 2024"
  ],
  "Instructors": "Hendry, Andrew; Larsson, Hans Carl (Fall)",
  "Notes": [
   "Fall",
   "2 hours lecture 3 hours lab",
   "Prerequisite: BIOL 205 and BIOL 215 or ENVR 202"
  ]
 },
 {
  "Title": "BIOL 313 Eukaryotic Cell Biology (3 credits)",
  "Code": "BIOL 313",
  "Credits": 3,
  "Overview": "Biology (Sci) : In-depth examination of the structure and function of eukaryotic cells, with an emphasis on experimental design and interpretation. Examination of the molecular mechanisms of various cellular processes, including protein homeostasis, intracellular transport, cytoskeletal dynamics, multicellular organization and cell proliferation.",
  "Meta": "Offered by: Biology (Faculty of Science)",
  "Terms": [
   "Winter 2025"
  ],
  "Instructors": "Weber, Stephanie (Winter)",
  "Notes": [
   "Winter",
   "3 hours lecture and 1 hour optional tutorial",
   "Prerequisites: BIOL 202 or BIOL 302; BIOL 219 or BIOL 200 plus either BIOL 201 or ANAT 212/BIOC 212"
  ]
 },
 {
  "Title": "BIOL 314 Molecular Biology of\n Cancer (3 credits)",
  "Code": "BIOL 314",
  "Credits": 3,
  "Overview": "Biology (Sci) : The molecular basis of human cancers, including analyzing the events that promote the formation of oncogenes and inhibit tumour suppressor genes, the biochemical properties of the proteins encoded by these genes, and their functions.\nCurrent molecular targets for cancer therapy and the concepts and consequences of inheriting mutations in genes that predispose to cancer.",
  "Meta": "Offered by: Biology (Faculty of Science)",
  "Terms": [
   "Winter 2025"
  ],
  "Instructors": "Dankort, David (Winter)",
  "Notes": [
   "Fall",
   "3 hours lecture",
   "Prerequisites: BIOL 200, and BIOL 201 or ANAT 212 /BIOC 212; or BIOL 219."
  ]
 },
 {
  "Title": "CHEM 482 Organic Chemistry: Natural Products (3 credits)",
  "Code": "CHEM 482",
  "Credits": 3,
  "Overview": "Chemistry : Structure, synthesis, stereochemistry and biosynthesis of terpenes, alkaloids, antibiotics and selected molecules of medicinal interest.",
  "Meta": "Offered by: Chemistry (Faculty of Science)",
  "Terms": [
   "Winter 2025"
  ],
  "Instructors": "Lumb, Jean-Philip (Winter)",
  "Notes": [
   "Prerequisite: CHEM 302",
   "Restriction(s): Not open to students who have taken CHEM 382.",
   "Winter"
  ]
 },
 {
  "Title": "CHEM 502 Advanced Bio-Organic Chemistry (3 credits)",
  "Code": "CHEM 502",
  "Credits": 3,
  "Overview": "Chemistry : This course will cover biologically relevant molecules, particularly nucleic acids, proteins, and their building blocks. In each case, synthesis and biological functions will be discussed. The topics include synthesis of oligonucleotides and peptides; chemistry of phosphates; enzyme structure and function; coenzymes, and enzyme catalysis; polyketides; antiviral and anticancer agents.",
  "Meta": "Offered by: Chemistry (Faculty of Science)",
  "Terms": [
   "Winter 2025"
  ],
  "Instructors": "Thibodeaux, Christopher; Wahba, Alexander; Mittermaier, Anthony (Winter)",
  "Notes": [
   "Winter",
   "Prerequisite: CHEM 302",
   "Restriction: Not open to students who have taken CHEM 402."
  ]
 },
 {
  "Title": "CHEM 532 Structural Organic Chemistry (3 credits)",
  "Code": "CHEM 532",
  "Credits": 3,
  "Overview": "Chemistry : A practical course on the application of modern spectroscopic methods for the determination of structures of complex organic and organometallic compounds.",
  "Meta": "Offered by: Chemistry (Faculty of Science)",
  "Terms": [
   "Fall 2024"
  ],
  "Instructors": "Gleason, James L (Fall)",
  "Notes": [
   "Winter",
   "Prerequisite: CHEM 302",
   "Restriction: Not open to students who have taken CHEM 352",
   "3 hours lecture",
   "1 hour Drop-in lab"
  ]
 },
 {
  "Title": "CHEM 552 Physical Organic Chemistry (3 credits)",
  "Code": "CHEM 552",
  "Credits": 3,
  "Overview": "Chemistry : The correlation of theory with physical measurements on organic systems; an introduction to photochemistry; solvent and substituent effects on organic reaction rates, etc.; reaction mechanisms.",
  "Meta": "Offered by: Chemistry (Faculty of Science)",
  "Terms": [
   "Fall 2024"
  ],
  "Instructors": "Cosa, Gonzalo; Moitessier, Nicolas; Perepichka, Dima (Fall)",
  "Notes": [
   "Winter",
   "Prerequisite: CHEM 302"
  ]
 },
 {
  "Title": "CHEM 572 Synthetic Organic Chemistry (3 credits)",
  "Code": "CHEM 572",
  "Credits": 3,
  "Overview": "Chemistry : Synthetic methods in organic chemistry and their application to the synthesis of complex molecules.",
  "Meta": "Offered by: Chemistry (Faculty of Science)",
  "Terms": [
   "Winter 2025"
  ],
  "Instructors": "Lumb, Jean-Philip (Winter)",
  "Notes": [
   "Winter",
   "Prerequisite: CHEM 382"
  ]
 },
 {
  "Title": "EXMD 502 Advanced Endocrinology 1 (3 credits)",
  "Code": "EXMD 502",
  "Credits": 3,
  "Overview": "Experimental Medicine : This course is designed for U3 students who are in a major or honours program in anatomy, biology, biochemistry or physiology and for graduate students. A multidisciplinary approach will be used to teach biosynthesis and processing of hormones, their regulation, function and mechanism of action. The material will cover hypothalamic, pituitary, thyroid, atrial and adrenal hormones as well as prostaglandins and related substances.",
  "Meta": "Offered by: Medicine (Faculty of Science)",
  "Terms": [
   "Fall 2024"
  ],
  "Instructors": "Kokoeva, Maia; Stroh, Thomas; Bateman, Andrew; Ali, Suhad; Morris, David; Giguere, Vincent; Laporte, Stephane; Rocheleau, Christian; Kiss, Robert; Murshed, Monzur (Fall)",
  "Notes": [
   "Fall"
  ]
 },
 {
  "Title": "MIMM 324 Fundamental Virology (3 credits)",
  "Code": "MIMM 324",
  "Credits": 3,
  "Overview": "Microbiology and Immun (Sci) : A study of the fundamental properties of viruses and their interactions with host cells. Bacteriophages, DNA- and RNA-containing animal viruses, and retroviruses are covered. Emphasis will be on phenomena occurring at the molecular level and on the regulated control of gene expression in virus-infected cells.",
  "Meta": "Offered by: Microbiology \u0026 Immunology (Faculty of Science)",
  "Terms": [
   "Fall 2024"
  ],
  "Instructors": "Teodoro, Jose Guerreiro; Liang, Chen; Kukolj, George; Briedis, Dalius J; Mouland, Andrew J; Archambault, Jacques (Fall)",
  "Notes": [
   "Fall",
   "3 hours of lecture",
   "Prerequisites: MIMM 211, BIOL 200, BIOL 201 or BIOC 212"
  ]
 },
 {
  "Title": "PHAR 300 Drug Action (3 credits)",
  "Code": "PHAR 300",
  "Credits": 3,
  "Overview": "Pharmacology and Therapeutics : Principles of pharmacology and toxicology. Frequently encountered drugs will be used as a focus to illustrate sites and mechanisms of action, distribution, metabolism, elimination and adverse side effects.",
  "Meta": "Offered by: Pharmacology and Therapeutics (Faculty of Science)",
  "Terms": [
   "Fall 2024"
  ],
  "Instructors": "Zorychta, Edith; Thanabalasuriar, Ajitha; Bernard, Daniel (Fall)",
  "Notes": [
   "Fall",
   "Prerequisites: BIOL 200, PHGY 209, PHGY 210 and one of BIOL 201 or ANAT/BIOC 212 or permission of instructor."
  ]
 },
 {
  "Title": "PHGY 311 Channels, Synapses and Hormones (3 credits)",
  "Code": "PHGY 311",
  "Credits": 3,
  "Overview": "Physiology : In-depth presentation of experimental results and hypotheses on cellular communication in the nervous system and the endocrine system.",
  "Meta": "Offered by: Physiology (Faculty of Science)",
  "Terms": [
   "Fall 2024"
  ],
  "Instructors": "Cooper, Ellis; Sjostrom, Per Jesper; Krishnaswamy, Arjun; Sharif Naeini, Reza (Fall)",
  "Notes": [
   "Fall",
   "3 hours of lectures per week; 1-3 hours optional lab/demonstration/tutorial arranged for a maximum of 3 afternoons per term",
   "Prerequisite: PHGY 209 or permission of the instructor."
  ]
 }
]
